[
    {
        "tag": "div",
        "cls": ["neo-header-text-container"],
        "cn" : [
            {
                "tag"      : "span",
                "cls"      : ["neo-header-text"],
                "innerHTML": "Tutorial: Concept"
            }
        ]
    },
    {
        "tag": "article",
        "cn" : [
            {
                "tag"      : "h4",
                "innerHTML": "Why yet another Javascript framework?"
            },
            {
                "tag": "ol",
                "cn" : [
                    {
                        "tag"      : "li",
                        "innerHTML": "neo.mjs is web workers driven"
                    },
                    {
                        "tag"      : "li",
                        "innerHTML": "neo.mjs does not need any cryptic XML markups"
                    },
                    {
                        "tag"      : "li",
                        "innerHTML": "neo.mjs uses a custom blazing fast virtual dom engine"
                    },
                    {
                        "tag"      : "li",
                        "innerHTML": "neo.mjs is based on EcmaScript 8 (ES8)"
                    },
                    {
                        "tag"      : "li",
                        "innerHTML": "neo.mjs uses HTML5 and CSS3 to the fullest"
                    },
                    {
                        "tag"      : "li",
                        "innerHTML": "Simplicity"
                    },
                    {
                        "tag"      : "li",
                        "innerHTML": "No transpiled code"
                    }
                ]
            },
            {
                "tag": "hr"
            },
            {
                "tag"      : "p",
                "innerHTML": "(1) neo.mjs uses 3 web workers:"
            },
            {
                "tag": "ul",
                "cn": [
                    {
                        "tag"      : "li",
                        "innerHTML": "App"
                    },
                    {
                        "tag"      : "li",
                        "innerHTML": "Data"
                    },
                    {
                        "tag"      : "li",
                        "innerHTML": "Vdom"
                    }
                ]
            },
            {
                "tag"      : "p",
                "innerHTML": "The main reason is that browsers by default only use 1 CPU core, while most computers and mobile devices have more. Multi-Threading solves this performance bottleneck and it will ensure that there are no hidden background-tasks in the main thread, which mess with your beautiful animations."
            },
            {
                "tag"      : "p",
                "innerHTML": "In short: Most parts of neo.mjs as well as all apps you will create are inside the App worker."
            },
            {
                "tag"      : "p",
                "innerHTML": "The main thread is only responsible to manipulate the DOM and delegate DOM events to the App worker."
            },
            {
                "tag"      : "p",
                "innerHTML": "The Data worker will perform all Ajax requests to your backend and host the Store instances."
            },
            {
                "tag"      : "p",
                "innerHTML": "The Vdom worker parses your JSON based markup (Vdom) into a virtual node (Vnode) and creates deltas when you dynamically change your Vdom."
            },
            {
                "tag"      : "p",
                "innerHTML": "(2) Did you ever enjoy writing pseudo-html including curly braces like {tpl if}, {tpl for} or even better {[this.doSomething()]}? Those XML templates evolved to a point, where they try to do everything what Javascript itself is capable of and you will most likely have encountered scoping issues (where does &quot;this&quot; point to now?). The solution is as simple as it should have been obvious for quite a while: JSON. You can easily manipulate Javascript objects with Javascript."
            },
            {
                "tag"      : "p",
                "innerHTML": "(3) Since neo.mjs does not need to parse XML templates back into JSON and then create virtual DOM nodes, the custom Vdom engine is blazing fast. The algorithms to create deltas are highly efficient and recognise moved DOM subtrees immediately."
            },
            {
                "tag"      : "p",
                "innerHTML": "(4) neo.mjs is most likely the first UI framework out there which does not only allow devs to create ES8 classes on top of ES5 prototypes, but is itself fully written in ES8."
            },
            {
                "tag"      : "p",
                "innerHTML": "(5) neo.mjs uses the latest web APIs and CSS features to the fullest and give you an easy and intuitive access to them."
            },
            {
                "tag"      : "p",
                "innerHTML": "(6) The first and most important design goal of neo.mjs is simplicity. This does not only mean to keep the code base as clean and simple as possible, but also to keep the created DOM as lightweight and minimal as possible."
            },
            {
                "tag"      : "p",
                "innerHTML": "(7) neo.mjs does not use Babel or any other tool to transpile code (which does not mean you can't use it for your own apps)."
            }
        ]
    }
]